#### Terraform prod Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.media_api.data.archive_file.media_uploads: Reading...
module.media_api.data.archive_file.push_notification: Reading...
module.media_api.data.archive_file.device_tokens: Reading...
module.media_api.data.archive_file.device_tokens: Read complete after 0s [id=75255a6b55d31d3d1bf20812c4ae2872361af718]
module.media_api.data.archive_file.media_uploads: Read complete after 0s [id=3ea3acf4ae0d8d8eaa0fe2993a2a304a74ec1d73]
module.media_api.data.archive_file.push_notification: Read complete after 0s [id=0cdad2f20bbe5a037ad2977aab790ce9b215d824]
module.media_api.aws_api_gateway_rest_api.media: Refreshing state... [id=6mph6q2qs7]
module.media_api.data.aws_region.current: Reading...
module.media_storage.data.aws_caller_identity.current: Reading...
module.media_api.aws_iam_role.create_upload_record: Refreshing state... [id=cloud-photos-prod-create-upload-record-role]
module.media_api.aws_iam_role.delete_upload_record: Refreshing state... [id=cloud-photos-prod-delete-upload-record-role]
module.media_db.aws_dynamodb_table.upload_records: Refreshing state... [id=cloud-photos-upload-records-prod]
module.media_api.aws_cloudwatch_log_group.lambda["create_upload_record"]: Refreshing state... [id=/aws/lambda/cloud-photos-prod-create-upload-record]
module.media_api.data.aws_region.current: Read complete after 0s [id=ap-northeast-1]
module.media_api.aws_cloudwatch_log_group.lambda["delete_upload_record"]: Refreshing state... [id=/aws/lambda/cloud-photos-prod-delete-upload-record]
module.media_api.aws_cloudwatch_log_group.lambda["get_upload_records"]: Refreshing state... [id=/aws/lambda/cloud-photos-prod-get-upload-records]
module.media_api.aws_iam_role.get_upload_records: Refreshing state... [id=cloud-photos-prod-get-upload-records-role]
module.media_storage.data.aws_caller_identity.current: Read complete after 0s [id=***]
module.identity_pool.data.aws_region.current: Reading...
module.identity_pool.data.aws_region.current: Read complete after 0s [id=ap-northeast-1]
module.cognito.aws_cognito_user_pool.main: Refreshing state... [id=ap-northeast-1_ArZMchMfd]
module.media_api.data.aws_caller_identity.current: Reading...
module.media_storage.aws_s3_bucket.media: Refreshing state... [id=***-cloud-photos-media-prod]
module.media_api.data.aws_caller_identity.current: Read complete after 0s [id=***]
module.media_api.aws_api_gateway_resource.media: Refreshing state... [id=2axtb0]
module.media_api.aws_api_gateway_gateway_response.default_5xx: Refreshing state... [id=aggr-6mph6q2qs7-DEFAULT_5XX]
module.media_api.aws_api_gateway_gateway_response.default_4xx: Refreshing state... [id=aggr-6mph6q2qs7-DEFAULT_4XX]
module.media_api.aws_iam_role_policy.get_upload_records_logs: Refreshing state... [id=cloud-photos-prod-get-upload-records-role:cloudwatch-logs]
module.media_api.aws_iam_role_policy.create_upload_record_logs: Refreshing state... [id=cloud-photos-prod-create-upload-record-role:cloudwatch-logs]
module.media_api.aws_iam_role_policy.delete_upload_record_logs: Refreshing state... [id=cloud-photos-prod-delete-upload-record-role:cloudwatch-logs]
module.media_api.aws_api_gateway_resource.uploads: Refreshing state... [id=59lb6f]
module.media_api.aws_api_gateway_resource.upload_item: Refreshing state... [id=0ze4g4]
module.media_api.aws_api_gateway_method.post_uploads: Refreshing state... [id=agm-6mph6q2qs7-59lb6f-POST]
module.media_api.aws_api_gateway_method.get_uploads: Refreshing state... [id=agm-6mph6q2qs7-59lb6f-GET]
module.media_api.aws_api_gateway_method.options_uploads: Refreshing state... [id=agm-6mph6q2qs7-59lb6f-OPTIONS]
module.cognito.aws_cognito_user_pool_client.main: Refreshing state... [id=mr95jbqfkm13eqgjrh505qi56]
module.media_api.aws_api_gateway_method.options_upload_item: Refreshing state... [id=agm-6mph6q2qs7-0ze4g4-OPTIONS]
module.media_api.aws_api_gateway_method.delete_upload: Refreshing state... [id=agm-6mph6q2qs7-0ze4g4-DELETE]
module.media_api.aws_api_gateway_method_response.options_uploads: Refreshing state... [id=agmr-6mph6q2qs7-59lb6f-OPTIONS-200]
module.media_api.aws_api_gateway_integration.options_uploads: Refreshing state... [id=agi-6mph6q2qs7-59lb6f-OPTIONS]
module.media_api.aws_api_gateway_method_response.options_upload_item: Refreshing state... [id=agmr-6mph6q2qs7-0ze4g4-OPTIONS-200]
module.media_api.aws_api_gateway_integration.options_upload_item: Refreshing state... [id=agi-6mph6q2qs7-0ze4g4-OPTIONS]
module.identity_pool.aws_cognito_identity_pool.main: Refreshing state... [id=ap-northeast-1:e4973375-0e3b-4da1-990f-3bf9ed0c9e6f]
module.media_api.aws_api_gateway_integration_response.options_uploads: Refreshing state... [id=agir-6mph6q2qs7-59lb6f-OPTIONS-200]
module.media_api.aws_iam_role_policy.delete_upload_record_dynamodb: Refreshing state... [id=cloud-photos-prod-delete-upload-record-role:dynamodb-delete]
module.media_api.aws_iam_role_policy.create_upload_record_dynamodb: Refreshing state... [id=cloud-photos-prod-create-upload-record-role:dynamodb-put]
module.media_api.aws_iam_role_policy.get_upload_records_dynamodb: Refreshing state... [id=cloud-photos-prod-get-upload-records-role:dynamodb-query]
module.media_api.aws_lambda_function.create_upload_record: Refreshing state... [id=cloud-photos-prod-create-upload-record]
module.media_api.aws_lambda_function.get_upload_records: Refreshing state... [id=cloud-photos-prod-get-upload-records]
module.media_api.aws_lambda_function.delete_upload_record: Refreshing state... [id=cloud-photos-prod-delete-upload-record]
module.media_api.aws_api_gateway_integration_response.options_upload_item: Refreshing state... [id=agir-6mph6q2qs7-0ze4g4-OPTIONS-200]
module.identity_pool.aws_iam_role.authenticated: Refreshing state... [id=cloud-photos-cognito-authenticated-prod]
module.identity_pool.aws_cognito_identity_pool_roles_attachment.main: Refreshing state... [id=ap-northeast-1:e4973375-0e3b-4da1-990f-3bf9ed0c9e6f]
module.identity_pool.aws_iam_role_policy.authenticated_api: Refreshing state... [id=cloud-photos-cognito-authenticated-prod:media-api-access]
module.media_api.aws_lambda_permission.post_uploads: Refreshing state... [id=AllowAPIGatewayInvoke]
module.media_api.aws_api_gateway_integration.post_uploads: Refreshing state... [id=agi-6mph6q2qs7-59lb6f-POST]
module.media_api.aws_lambda_permission.get_uploads: Refreshing state... [id=AllowAPIGatewayInvoke]
module.media_api.aws_api_gateway_integration.get_uploads: Refreshing state... [id=agi-6mph6q2qs7-59lb6f-GET]
module.media_api.aws_lambda_permission.delete_upload: Refreshing state... [id=AllowAPIGatewayInvoke]
module.media_api.aws_api_gateway_integration.delete_upload: Refreshing state... [id=agi-6mph6q2qs7-0ze4g4-DELETE]
module.media_api.aws_api_gateway_deployment.media: Refreshing state... [id=7vc2pi]
module.media_api.aws_api_gateway_stage.media: Refreshing state... [id=ags-6mph6q2qs7-prod]
module.media_storage.aws_s3_bucket_versioning.media: Refreshing state... [id=***-cloud-photos-media-prod]
module.identity_pool.aws_iam_role_policy.authenticated_s3: Refreshing state... [id=cloud-photos-cognito-authenticated-prod:media-storage-access]
module.media_storage.aws_s3_bucket_server_side_encryption_configuration.media: Refreshing state... [id=***-cloud-photos-media-prod]
module.media_storage.aws_s3_bucket_public_access_block.media: Refreshing state... [id=***-cloud-photos-media-prod]
module.media_storage.aws_s3_bucket_lifecycle_configuration.media: Refreshing state... [id=***-cloud-photos-media-prod]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.device_token_db.aws_dynamodb_table.device_tokens will be created
  + resource "aws_dynamodb_table" "device_tokens" {
      + arn                         = (known after apply)
      + billing_mode                = "PAY_PER_REQUEST"
      + deletion_protection_enabled = true
      + hash_key                    = "userId"
      + id                          = (known after apply)
      + name                        = "cloud-photos-device-tokens-prod"
      + range_key                   = "deviceToken"
      + read_capacity               = (known after apply)
      + region                      = "ap-northeast-1"
      + stream_arn                  = (known after apply)
      + stream_label                = (known after apply)
      + stream_view_type            = (known after apply)
      + tags_all                    = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "cloud-photos"
        }
      + write_capacity              = (known after apply)

      + attribute {
          + name = "deviceToken"
          + type = "S"
        }
      + attribute {
          + name = "userId"
          + type = "S"
        }

      + global_secondary_index (known after apply)

      + global_table_witness (known after apply)

      + point_in_time_recovery {
          + enabled                 = true
          + recovery_period_in_days = (known after apply)
        }

      + server_side_encryption (known after apply)

      + ttl (known after apply)

      + warm_throughput (known after apply)
    }

  # module.identity_pool.aws_iam_role_policy.authenticated_api will be updated in-place
  ~ resource "aws_iam_role_policy" "authenticated_api" {
        id          = "cloud-photos-cognito-authenticated-prod:media-api-access"
        name        = "media-api-access"
      ~ policy      = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Resource = [
                            # (2 unchanged elements hidden)
                            "arn:aws:execute-api:ap-northeast-1:***:6mph6q2qs7/*/DELETE/media/uploads/*",
                          + "arn:aws:execute-api:ap-northeast-1:***:6mph6q2qs7/*/PUT/devices/token",
                          + "arn:aws:execute-api:ap-northeast-1:***:6mph6q2qs7/*/DELETE/devices/token",
                          + "arn:aws:execute-api:ap-northeast-1:***:6mph6q2qs7/*/POST/media/uploads/complete",
                        ]
                        # (3 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (2 unchanged attributes hidden)
    }

  # module.media_api.aws_api_gateway_deployment.media must be replaced
+/- resource "aws_api_gateway_deployment" "media" {
      ~ created_date = "2026-03-14T01:50:34Z" -> (known after apply)
      ~ id           = "7vc2pi" -> (known after apply)
      ~ triggers     = {
          - "redeployment" = "ff04e77171a58d71dc6c6ea7eb4569d8f26d3fca"
        } -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.media_api.aws_api_gateway_gateway_response.default_4xx will be updated in-place
  ~ resource "aws_api_gateway_gateway_response" "default_4xx" {
        id                  = "aggr-6mph6q2qs7-DEFAULT_4XX"
      ~ response_templates  = {
          - "application/json" = "{\"message\":$context.error.messageString}" -> null
        }
        # (5 unchanged attributes hidden)
    }

  # module.media_api.aws_api_gateway_gateway_response.default_5xx will be updated in-place
  ~ resource "aws_api_gateway_gateway_response" "default_5xx" {
        id                  = "aggr-6mph6q2qs7-DEFAULT_5XX"
      ~ response_templates  = {
          - "application/json" = "{\"message\":$context.error.messageString}" -> null
        }
        # (5 unchanged attributes hidden)
    }

  # module.media_api.aws_api_gateway_integration.delete_devices_token will be created
  + resource "aws_api_gateway_integration" "delete_devices_token" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "DELETE"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + region                  = "ap-northeast-1"
      + resource_id             = (known after apply)
      + response_transfer_mode  = (known after apply)
      + rest_api_id             = "6mph6q2qs7"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.media_api.aws_api_gateway_integration.options_devices_token will be created
  + resource "aws_api_gateway_integration" "options_devices_token" {
      + cache_namespace        = (known after apply)
      + connection_type        = "INTERNET"
      + http_method            = "OPTIONS"
      + id                     = (known after apply)
      + passthrough_behavior   = (known after apply)
      + region                 = "ap-northeast-1"
      + request_templates      = {
          + "application/json" = jsonencode(
                {
                  + statusCode = 200
                }
            )
        }
      + resource_id            = (known after apply)
      + response_transfer_mode = (known after apply)
      + rest_api_id            = "6mph6q2qs7"
      + timeout_milliseconds   = 29000
      + type                   = "MOCK"
    }

  # module.media_api.aws_api_gateway_integration.options_uploads_complete will be created
  + resource "aws_api_gateway_integration" "options_uploads_complete" {
      + cache_namespace        = (known after apply)
      + connection_type        = "INTERNET"
      + http_method            = "OPTIONS"
      + id                     = (known after apply)
      + passthrough_behavior   = (known after apply)
      + region                 = "ap-northeast-1"
      + request_templates      = {
          + "application/json" = jsonencode(
                {
                  + statusCode = 200
                }
            )
        }
      + resource_id            = (known after apply)
      + response_transfer_mode = (known after apply)
      + rest_api_id            = "6mph6q2qs7"
      + timeout_milliseconds   = 29000
      + type                   = "MOCK"
    }

  # module.media_api.aws_api_gateway_integration.post_uploads_complete will be created
  + resource "aws_api_gateway_integration" "post_uploads_complete" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + region                  = "ap-northeast-1"
      + resource_id             = (known after apply)
      + response_transfer_mode  = (known after apply)
      + rest_api_id             = "6mph6q2qs7"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.media_api.aws_api_gateway_integration.put_devices_token will be created
  + resource "aws_api_gateway_integration" "put_devices_token" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "PUT"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + region                  = "ap-northeast-1"
      + resource_id             = (known after apply)
      + response_transfer_mode  = (known after apply)
      + rest_api_id             = "6mph6q2qs7"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.media_api.aws_api_gateway_integration_response.options_devices_token will be created
  + resource "aws_api_gateway_integration_response" "options_devices_token" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + region              = "ap-northeast-1"
      + resource_id         = (known after apply)
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = "'Content-Type,X-Amz-Date,Authorization,X-Api-Key,X-Amz-Security-Token,X-Amz-User-Agent'"
          + "method.response.header.Access-Control-Allow-Methods" = "'PUT,DELETE,OPTIONS'"
          + "method.response.header.Access-Control-Allow-Origin"  = "'*'"
        }
      + rest_api_id         = "6mph6q2qs7"
      + status_code         = "200"
    }

  # module.media_api.aws_api_gateway_integration_response.options_uploads_complete will be created
  + resource "aws_api_gateway_integration_response" "options_uploads_complete" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + region              = "ap-northeast-1"
      + resource_id         = (known after apply)
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = "'Content-Type,X-Amz-Date,Authorization,X-Api-Key,X-Amz-Security-Token,X-Amz-User-Agent'"
          + "method.response.header.Access-Control-Allow-Methods" = "'POST,OPTIONS'"
          + "method.response.header.Access-Control-Allow-Origin"  = "'*'"
        }
      + rest_api_id         = "6mph6q2qs7"
      + status_code         = "200"
    }

  # module.media_api.aws_api_gateway_method.delete_devices_token will be created
  + resource "aws_api_gateway_method" "delete_devices_token" {
      + api_key_required = false
      + authorization    = "AWS_IAM"
      + http_method      = "DELETE"
      + id               = (known after apply)
      + region           = "ap-northeast-1"
      + resource_id      = (known after apply)
      + rest_api_id      = "6mph6q2qs7"
    }

  # module.media_api.aws_api_gateway_method.options_devices_token will be created
  + resource "aws_api_gateway_method" "options_devices_token" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "OPTIONS"
      + id               = (known after apply)
      + region           = "ap-northeast-1"
      + resource_id      = (known after apply)
      + rest_api_id      = "6mph6q2qs7"
    }

  # module.media_api.aws_api_gateway_method.options_uploads_complete will be created
  + resource "aws_api_gateway_method" "options_uploads_complete" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "OPTIONS"
      + id               = (known after apply)
      + region           = "ap-northeast-1"
      + resource_id      = (known after apply)
      + rest_api_id      = "6mph6q2qs7"
    }

  # module.media_api.aws_api_gateway_method.post_uploads_complete will be created
  + resource "aws_api_gateway_method" "post_uploads_complete" {
      + api_key_required = false
      + authorization    = "AWS_IAM"
      + http_method      = "POST"
      + id               = (known after apply)
      + region           = "ap-northeast-1"
      + resource_id      = (known after apply)
      + rest_api_id      = "6mph6q2qs7"
    }

  # module.media_api.aws_api_gateway_method.put_devices_token will be created
  + resource "aws_api_gateway_method" "put_devices_token" {
      + api_key_required = false
      + authorization    = "AWS_IAM"
      + http_method      = "PUT"
      + id               = (known after apply)
      + region           = "ap-northeast-1"
      + resource_id      = (known after apply)
      + rest_api_id      = "6mph6q2qs7"
    }

  # module.media_api.aws_api_gateway_method_response.options_devices_token will be created
  + resource "aws_api_gateway_method_response" "options_devices_token" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + region              = "ap-northeast-1"
      + resource_id         = (known after apply)
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = true
          + "method.response.header.Access-Control-Allow-Methods" = true
          + "method.response.header.Access-Control-Allow-Origin"  = true
        }
      + rest_api_id         = "6mph6q2qs7"
      + status_code         = "200"
    }

  # module.media_api.aws_api_gateway_method_response.options_uploads_complete will be created
  + resource "aws_api_gateway_method_response" "options_uploads_complete" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + region              = "ap-northeast-1"
      + resource_id         = (known after apply)
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = true
          + "method.response.header.Access-Control-Allow-Methods" = true
          + "method.response.header.Access-Control-Allow-Origin"  = true
        }
      + rest_api_id         = "6mph6q2qs7"
      + status_code         = "200"
    }

  # module.media_api.aws_api_gateway_resource.devices will be created
  + resource "aws_api_gateway_resource" "devices" {
      + id          = (known after apply)
      + parent_id   = "y99gzzh16a"
      + path        = (known after apply)
      + path_part   = "devices"
      + region      = "ap-northeast-1"
      + rest_api_id = "6mph6q2qs7"
    }

  # module.media_api.aws_api_gateway_resource.devices_token will be created
  + resource "aws_api_gateway_resource" "devices_token" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "token"
      + region      = "ap-northeast-1"
      + rest_api_id = "6mph6q2qs7"
    }

  # module.media_api.aws_api_gateway_resource.uploads_complete will be created
  + resource "aws_api_gateway_resource" "uploads_complete" {
      + id          = (known after apply)
      + parent_id   = "59lb6f"
      + path        = (known after apply)
      + path_part   = "complete"
      + region      = "ap-northeast-1"
      + rest_api_id = "6mph6q2qs7"
    }

  # module.media_api.aws_api_gateway_stage.media will be updated in-place
  ~ resource "aws_api_gateway_stage" "media" {
      ~ deployment_id         = "7vc2pi" -> (known after apply)
        id                    = "ags-6mph6q2qs7-prod"
        tags                  = {}
        # (15 unchanged attributes hidden)
    }

  # module.media_api.aws_cloudwatch_log_group.lambda["notify_upload_complete"] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn                         = (known after apply)
      + deletion_protection_enabled = (known after apply)
      + id                          = (known after apply)
      + log_group_class             = (known after apply)
      + name                        = "/aws/lambda/cloud-photos-prod-notify-upload-complete"
      + name_prefix                 = (known after apply)
      + region                      = "ap-northeast-1"
      + retention_in_days           = 90
      + skip_destroy                = false
      + tags_all                    = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "cloud-photos"
        }
    }

  # module.media_api.aws_cloudwatch_log_group.lambda["register_device_token"] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn                         = (known after apply)
      + deletion_protection_enabled = (known after apply)
      + id                          = (known after apply)
      + log_group_class             = (known after apply)
      + name                        = "/aws/lambda/cloud-photos-prod-register-device-token"
      + name_prefix                 = (known after apply)
      + region                      = "ap-northeast-1"
      + retention_in_days           = 90
      + skip_destroy                = false
      + tags_all                    = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "cloud-photos"
        }
    }

  # module.media_api.aws_cloudwatch_log_group.lambda["unregister_device_token"] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn                         = (known after apply)
      + deletion_protection_enabled = (known after apply)
      + id                          = (known after apply)
      + log_group_class             = (known after apply)
      + name                        = "/aws/lambda/cloud-photos-prod-unregister-device-token"
      + name_prefix                 = (known after apply)
      + region                      = "ap-northeast-1"
      + retention_in_days           = 90
      + skip_destroy                = false
      + tags_all                    = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "cloud-photos"
        }
    }

  # module.media_api.aws_iam_role.notify_upload_complete will be created
  + resource "aws_iam_role" "notify_upload_complete" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "cloud-photos-prod-notify-upload-complete-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "cloud-photos"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.media_api.aws_iam_role.register_device_token will be created
  + resource "aws_iam_role" "register_device_token" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "cloud-photos-prod-register-device-token-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "cloud-photos"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.media_api.aws_iam_role.unregister_device_token will be created
  + resource "aws_iam_role" "unregister_device_token" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "cloud-photos-prod-unregister-device-token-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "cloud-photos"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.media_api.aws_iam_role_policy.notify_upload_complete_dynamodb will be created
  + resource "aws_iam_role_policy" "notify_upload_complete_dynamodb" {
      + id          = (known after apply)
      + name        = "dynamodb-query-delete"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # module.media_api.aws_iam_role_policy.notify_upload_complete_logs will be created
  + resource "aws_iam_role_policy" "notify_upload_complete_logs" {
      + id          = (known after apply)
      + name        = "cloudwatch-logs"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # module.media_api.aws_iam_role_policy.notify_upload_complete_secrets will be created
  + resource "aws_iam_role_policy" "notify_upload_complete_secrets" {
      + id          = (known after apply)
      + name        = "secretsmanager-get"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # module.media_api.aws_iam_role_policy.register_device_token_dynamodb will be created
  + resource "aws_iam_role_policy" "register_device_token_dynamodb" {
      + id          = (known after apply)
      + name        = "dynamodb-update"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # module.media_api.aws_iam_role_policy.register_device_token_logs will be created
  + resource "aws_iam_role_policy" "register_device_token_logs" {
      + id          = (known after apply)
      + name        = "cloudwatch-logs"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # module.media_api.aws_iam_role_policy.unregister_device_token_dynamodb will be created
  + resource "aws_iam_role_policy" "unregister_device_token_dynamodb" {
      + id          = (known after apply)
      + name        = "dynamodb-delete"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # module.media_api.aws_iam_role_policy.unregister_device_token_logs will be created
  + resource "aws_iam_role_policy" "unregister_device_token_logs" {
      + id          = (known after apply)
      + name        = "cloudwatch-logs"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # module.media_api.aws_lambda_function.create_upload_record will be updated in-place
  ~ resource "aws_lambda_function" "create_upload_record" {
        id                             = "cloud-photos-prod-create-upload-record"
      ~ last_modified                  = "2026-03-19T10:48:45.000+0000" -> (known after apply)
      ~ source_code_hash               = "ougJQCGeSQYtL8nbVjygbSEMwVb3/GjDPHt/GoW9Fmc=" -> "odkpuEgjsOgLvDeM14Y9vOESlIfRDGEY40P1elZtY9k="
        tags                           = {}
        # (30 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.media_api.aws_lambda_function.delete_upload_record will be updated in-place
  ~ resource "aws_lambda_function" "delete_upload_record" {
        id                             = "cloud-photos-prod-delete-upload-record"
      ~ last_modified                  = "2026-03-19T10:48:58.000+0000" -> (known after apply)
      ~ source_code_hash               = "ougJQCGeSQYtL8nbVjygbSEMwVb3/GjDPHt/GoW9Fmc=" -> "odkpuEgjsOgLvDeM14Y9vOESlIfRDGEY40P1elZtY9k="
        tags                           = {}
        # (30 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.media_api.aws_lambda_function.get_upload_records will be updated in-place
  ~ resource "aws_lambda_function" "get_upload_records" {
        id                             = "cloud-photos-prod-get-upload-records"
      ~ last_modified                  = "2026-03-19T10:48:52.000+0000" -> (known after apply)
      ~ source_code_hash               = "ougJQCGeSQYtL8nbVjygbSEMwVb3/GjDPHt/GoW9Fmc=" -> "odkpuEgjsOgLvDeM14Y9vOESlIfRDGEY40P1elZtY9k="
        tags                           = {}
        # (30 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.media_api.aws_lambda_function.notify_upload_complete will be created
  + resource "aws_lambda_function" "notify_upload_complete" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "../../modules/media_api/../../.build/push_notification.zip"
      + function_name                  = "cloud-photos-prod-notify-upload-complete"
      + handler                        = "notify_upload_complete.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 256
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "ap-northeast-1"
      + reserved_concurrent_executions = -1
      + response_streaming_invoke_arn  = (known after apply)
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "nj8gQgpsjZhWlfQtiZulmhCWnVLWDQPThjGyfc7yItI="
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "cloud-photos"
        }
      + timeout                        = 30
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # module.media_api.aws_lambda_function.register_device_token will be created
  + resource "aws_lambda_function" "register_device_token" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "../../modules/media_api/../../.build/device_tokens.zip"
      + function_name                  = "cloud-photos-prod-register-device-token"
      + handler                        = "register_device_token.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 256
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "ap-northeast-1"
      + reserved_concurrent_executions = -1
      + response_streaming_invoke_arn  = (known after apply)
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "od9JrASFdbOcYCOl+FBi5Y69c39DaSk5A9Hi5fpv7QQ="
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "cloud-photos"
        }
      + timeout                        = 10
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "TABLE_NAME" = "cloud-photos-device-tokens-prod"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # module.media_api.aws_lambda_function.unregister_device_token will be created
  + resource "aws_lambda_function" "unregister_device_token" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "../../modules/media_api/../../.build/device_tokens.zip"
      + function_name                  = "cloud-photos-prod-unregister-device-token"
      + handler                        = "unregister_device_token.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 256
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "ap-northeast-1"
      + reserved_concurrent_executions = -1
      + response_streaming_invoke_arn  = (known after apply)
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "od9JrASFdbOcYCOl+FBi5Y69c39DaSk5A9Hi5fpv7QQ="
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "cloud-photos"
        }
      + timeout                        = 10
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "TABLE_NAME" = "cloud-photos-device-tokens-prod"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # module.media_api.aws_lambda_permission.delete_devices_token will be created
  + resource "aws_lambda_permission" "delete_devices_token" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "cloud-photos-prod-unregister-device-token"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + region              = "ap-northeast-1"
      + source_arn          = "arn:aws:execute-api:ap-northeast-1:***:6mph6q2qs7/*/DELETE/devices/token"
      + statement_id        = "AllowAPIGatewayInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.media_api.aws_lambda_permission.post_uploads_complete will be created
  + resource "aws_lambda_permission" "post_uploads_complete" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "cloud-photos-prod-notify-upload-complete"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + region              = "ap-northeast-1"
      + source_arn          = "arn:aws:execute-api:ap-northeast-1:***:6mph6q2qs7/*/POST/media/uploads/complete"
      + statement_id        = "AllowAPIGatewayInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.media_api.aws_lambda_permission.put_devices_token will be created
  + resource "aws_lambda_permission" "put_devices_token" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "cloud-photos-prod-register-device-token"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + region              = "ap-northeast-1"
      + source_arn          = "arn:aws:execute-api:ap-northeast-1:***:6mph6q2qs7/*/PUT/devices/token"
      + statement_id        = "AllowAPIGatewayInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.push_notification.aws_lambda_layer_version.firebase_admin will be created
  + resource "aws_lambda_layer_version" "firebase_admin" {
      + arn                         = (known after apply)
      + code_sha256                 = (known after apply)
      + compatible_architectures    = [
          + "x86_64",
        ]
      + compatible_runtimes         = [
          + "python3.12",
        ]
      + created_date                = (known after apply)
      + filename                    = "../../modules/push_notification/../../.build/firebase_admin_layer.zip"
      + id                          = (known after apply)
      + layer_arn                   = (known after apply)
      + layer_name                  = "cloud-photos-firebase-admin-prod"
      + region                      = "ap-northeast-1"
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + skip_destroy                = false
      + source_code_hash            = "66ivaEOdwCnLU3f0z5uue3hqy+vgr+R3N9eg5zbtR90="
      + source_code_size            = (known after apply)
      + version                     = (known after apply)
    }

  # module.push_notification.aws_secretsmanager_secret.firebase_credentials will be created
  + resource "aws_secretsmanager_secret" "firebase_credentials" {
      + arn                            = (known after apply)
      + description                    = "Firebase Admin SDK service account key for push notifications"
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "cloud-photos-firebase-credentials-prod"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + region                         = "ap-northeast-1"
      + tags_all                       = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "cloud-photos"
        }

      + replica (known after apply)
    }

Plan: 40 to add, 7 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<!-- terraform-plan-prod -->